kthunder/ch32v305_dap/User/DAP_config.h
For the SWDIO I/O Pin there are additional functions that are called in SWD I/O mode only.
This functions are provided to achieve faster I/O that is possible with some advanced GPIO
peripherals that can independently write/read a single I/O pin without affecting any other pins
of the same I/O port. The following SWDIO I/O Pin functions are provided:
 - \ref PIN_SWDIO_OUT_ENABLE to enable the output mode from the DAP hardware.
 - \ref PIN_SWDIO_OUT_DISABLE to enable the input mode to the DAP hardware.
 - \ref PIN_SWDIO_IN to read from the SWDIO I/O pin with utmost possible speed.
 - \ref PIN_SWDIO_OUT to write to the SWDIO I/O pin with utmost possible speed.
*/
// GPIOA
#define PORT_CLK GPIOA
#define PORT_DIO GPIOA
#define PIN_CLK GPIO_Pin_14
#define PIN_DIO GPIO_Pin_13
// GPIOB
#define PORT_TDI GPIOB
#define PORT_TDO GPIOB
#define PIN_TDI GPIO_Pin_15
#define PIN_TDO GPIO_Pin_14

#define PORT_DIR GPIOB
#define PIN_DIR GPIO_Pin_15
// GPIOC
#define PORT_nRESET GPIOC
#define PIN_nRESET GPIO_Pin_8
// 每次写gpio外设后需要插入至少3个NOP
// 0b1000上下拉输入
// 0b0011推挽输出
// clang-format off
#define NOPx1() __NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();__NOP();
#define NOPx3() NOPx1();NOPx1();NOPx1();
#define iPIN_TMS_INPUT_ENABLE()      PORT_DIO->CFGHR&=(~(0xF<<((13-8)*4)));PORT_DIO->CFGHR|=(0b1000<<((13-8)*4));PORT_DIO->BSHR=PIN_DIO;NOPx3();
#define iPIN_TMS_INPUT_DISABLE()     PORT_DIO->CFGHR&=(~(0xF<<((13-8)*4)));PORT_DIO->CFGHR|=(0b0011<<((13-8)*4));NOPx3();
// #define iPIN_TMSC_OUT_SIDE_SET(bit)  cJTAG_TMSC_PIN_PORT->BSRR = (cJTAG_TCKC_PIN<< 0)|(cJTAG_TMSC_PIN << (bit?0:16));NOP()
// #define iPIN_TMSC_OUT_SIDE_CLR(bit)  cJTAG_TMSC_PIN_PORT->BSRR = (cJTAG_TCKC_PIN<<16)|(cJTAG_TMSC_PIN << (bit?0:16));NOP()

#define iGPIO_PUT(port, pin, val)   port->BSHR = ((val)&1)?pin:(pin<<16)
#define iGPIO_GET(port, pin)        ((port->INDR & pin)>0)
#define iGPIO_SET(port, pin)        port->BSHR = pin
#define iGPIO_CLR(port, pin)        port->BCR = pin

#define iPIN_TCK_SET()  iGPIO_SET(PORT_CLK, PIN_CLK);NOPx3();
#define iPIN_TCK_CLR()  iGPIO_CLR(PORT_CLK, PIN_CLK);NOPx3();
#define iPIN_TMS_SET()  iGPIO_SET(PORT_DIO, PIN_DIO);NOPx3();
#define iPIN_TMS_CLR()  iGPIO_CLR(PORT_DIO, PIN_DIO);NOPx3();
#define iPIN_TMS_OUT(x) iGPIO_PUT(PORT_DIO, PIN_DIO, (x&1));NOPx3();
#define iPIN_TDO_GET()  iGPIO_GET(PORT_DIO, PIN_DIO);NOPx3();

#define JTAG_CYCLE_TCK_FAST(tms, tdi, tdo) \
    do                                     \
    {                                      \
        iPIN_TCK_CLR();                    \
        iPIN_TMS_OUT(!tdi);                \
        iPIN_TCK_SET();                    \
        iPIN_TCK_CLR();                    \
        iPIN_TMS_OUT(tms);                 \
        iPIN_TCK_SET();                    \
        iGPIO_CLR(PORT_DIR, PIN_DIR);      \
        iPIN_TMS_INPUT_ENABLE();           \
        iPIN_TCK_CLR();                    \
        iPIN_TCK_SET();                    \
        tdo = iPIN_TDO_GET();              \
        iPIN_TCK_CLR();                    \
        iGPIO_SET(PORT_DIR, PIN_DIR);      \
        iPIN_TMS_INPUT_DISABLE();          \
    } while (0);
// clang-format on

// Configure DAP I/O pins ------------------------------

/** Setup JTAG I/O pins: TCK, TMS, TDI, TDO, nTRST, and nRESET.
Configures the DAP Hardware I/O pins for JTAG mode:
 - TCK, TMS, TDI, nTRST, nRESET to output mode and set to high level.
 - TDO to input mode.
*/
__STATIC_INLINE void PORT_JTAG_SETUP (void) {
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    // SWD IO
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    GPIO_InitStructure.GPIO_Pin = PIN_CLK | PIN_DIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_SetBits(GPIOA, PIN_CLK | PIN_DIO);

    // RST
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    GPIO_InitStructure.GPIO_Pin = PIN_nRESET;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_SetBits(GPIOC, PIN_nRESET);

    // TDI TDO
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    GPIO_InitStructure.GPIO_Pin = PIN_TDI;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = PIN_TDO;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_SetBits(GPIOB, PIN_TDI);
}

/** Setup SWD I/O pins: SWCLK, SWDIO, and nRESET.
Configures the DAP Hardware I/O pins for Serial Wire Debug (SWD) mode:
 - SWCLK, SWDIO, nRESET to output mode and set to default high level.
 - TDI, nTRST to HighZ mode (pins are unused in SWD mode).
*/
__STATIC_INLINE void PORT_SWD_SETUP (void) {
    GPIO_InitTypeDef GPIO_InitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    GPIO_InitStructure.GPIO_Pin = PIN_CLK | PIN_DIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_SetBits(GPIOA, PIN_CLK | PIN_DIO);

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    GPIO_InitStructure.GPIO_Pin = PIN_nRESET;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_SetBits(GPIOC, PIN_nRESET);

    // TDI
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    GPIO_InitStructure.GPIO_Pin = PIN_TDI;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    GPIO_SetBits(GPIOB, PIN_TDI);
}

/** Disable JTAG/SWD I/O Pins.
Disables the DAP Hardware I/O pins which configures:
 - TCK/SWCLK, TMS/SWDIO, TDI, TDO, nTRST, nRESET to High-Z mode.
*/
__STATIC_INLINE void PORT_OFF (void) {
    GPIO_InitTypeDef GPIO_InitStructure = {0};

    GPIO_InitStructure.GPIO_Pin = PIN_CLK | PIN_DIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = PIN_nRESET;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = PIN_TDI | PIN_TDO;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
}


// SWCLK/TCK I/O pin -------------------------------------

/** SWCLK/TCK I/O pin: Get Input.
\return Current status of the SWCLK/TCK DAP hardware I/O pin.
*/
__STATIC_FORCEINLINE uint32_t PIN_SWCLK_TCK_IN  (void) {
    return iGPIO_GET(PORT_CLK, PIN_CLK);
}

